app/Controllers/Auth.php

SELECT *
FROM `students`
WHERE `matric` = '1809822650'
 LIMIT 1
---
    public function signin()
    {
        $studentmodel = new StudentModel();
        $login_data = $this->request->getPost(); // get the login data and saving it in a variable
        $isStudent = $studentmodel->where('matric', $login_data['matric'])->first();

SELECT *
FROM `students`
WHERE `matric` = '1806769375'
 LIMIT 1
---
    private function findStudent($matric_number)
    {
        $studentmodel = model(StudentModel::class);
        $result = $studentmodel->where('matric', $matric_number)->first();

SELECT *
FROM `profileimages`
WHERE `student_id` = '13'
 LIMIT 1
---
    private function getStudentImage($id)
    {
        $imagemodel = model(ProfileImageModel::class);
        $result = $imagemodel->where('student_id', $id)->first();