app/Controllers/Auth.php

    private function findStudent($matric_number)
    {
        $studentmodel = model(StudentModel::class);
        $result = $studentmodel->where('matric', $matric_number)->first();
---
SELECT *
FROM `students`
WHERE `matric` = '1809353760'
 LIMIT 1