app/Controllers/Biodata.php

    public function studentdata()
    {
        $studentmodel = model(StudentModel::class);
        $this->viewBag['student'] = $studentmodel->where('id', $_SESSION['id'])->first();
---
SELECT *
FROM `students`
WHERE `id` = '11'
 LIMIT 1