app/Controllers/Biodata.php

SELECT *
FROM `students`
WHERE `id` = '12'
 LIMIT 1
---
    public function studentdata()
    {
        $studentmodel = model(StudentModel::class);
        $this->viewBag['student'] = $studentmodel->where('id', $_SESSION['id'])->first();

SELECT *
FROM `students`
WHERE `id` = '13'
 LIMIT 1
---
    public function download($id)
    {
        $studentModel = model(StudentModel::class);
        $studentData = $studentModel->where('id', $id)->first();